{"about":{"id":1,"content":["Hi! I’m Shahabas Abdul Hameed, a full-stack web developer with a passion for coding and technology. Currently, I’m pursuing a BCA in software development and web design at Srinivas University in Mangalore.","I specialize in both front-end and back-end development and enjoy transforming ideas into functional, user-friendly web applications. Always eager to learn, I stay up to date with the latest trends and tools to improve my skills and approach to development.","In addition to my technical expertise, I focus on creating seamless user experiences and enjoy working on personal projects to explore new concepts and refine my craft."]},"projects":[{"id":1,"ready":true,"heading":"SIMS","desc":"Smart Inventory Management System","url":{"github":{"link":"https://github.com/S488U/sims-backend","color":"text-white","bg":"bg-black"},"live":{"link":"https://suims.vercel.app/","color":"text-black","bg":"bg-white"}},"hosted":"Hosted in Vercel","image":"/images/vercel.svg","technologies":["NodeJS","ExpressJS","ReactJS","JWT","Rest API","MongoDB","Express-Async-Handler"],"brief":"#### A Small Blog\nHi Everyone.\n\nThis is my college project we done it in the final year project of BCA degree.\n\nThere is a small story behind this project idea. One morning,  my friend and our classmates and I were travelling to Mangalore for the Synopsis submission for the final project. But we have a problem here. We didn't come up with any idea to submit the synopsis.\n\nWe eagerly started to search for ideas in ChatGPT and we came up with two ideas that we are confident in building. And we prepared two Synopsis.\n\n- One synopsis is for a Inventory Management System.\n- One for more complex than Inventory Management System.\n\nBut here we are confident on the Inventory Management System will get approved by the Head of the Department. And at last our synopsis is accepted.\n\nOur Synopsis contains 3 applications for the project:\n- A user Web application for purchasing the products.\n- A Staff Mobile application for the delivery agents to deliver the products to the location.\n- A admin dashboard to manage the users and staff and a overall power on the products on the warehouse.\n\nWait!! I didn't explained what in our `Inventory Management system` includes.\n\nFirst of all, Inventory Management System is our Final year project and we named the project as `Smart Inventory Management System`. We planned to build this software for the **[FMCG](https://en.wikipedia.org/wiki/Fast-moving_consumer_goods) distributors of India**.\n\nWe planned a lot of functionalities for the project. I'll explain one by one....\n\n\n##### For Admin\nAdmin Manages all the retailers(users), suppliers and staffs and the products.\nFunctionality proposed for the admin is;\n- Managing Users(Retailers) with add, delete, edit.\n- Managing Suppliers with add, delete, edit and add their products and control the products in the warehouse.\n- Managing staff with delivery locations and delivered products.\n- Generate invoice and send invoice.\n- view feedback from users.\n- Generate overall data by month or week.\n\n###### For Retailers\n- Login window.\n- Able to add products to cart and purchase.\n- View deliveries info in order section.\n- View all invoice.\n- Export paid invoice.\n- Change customer personal info.\n\n###### For Staffs\n- Manage stocks info from their mobile.\n- Adding stocks.\n- Able to deliver products to users.\n- Alert Admin if stocks are low.\n\nThese are the things we planned for our applications. And we started to do our project. Our Frontend was handled my classmate [Nihal K](https://github.com/ioNihal). It is a two people project. He handled all the frontend sides and I handled the backend side.\n\nHe choose to develop the applications Frontend with these technologies: `ReactJS`, `recharts`, `react-pdf`, `html2canvas`.\n\nAnd I choose to develop the applications Backend with these: `ExpressJS`, `dayjs`, `express-async-hanlder`, `MongoDB`, `JWT`.\n\nI mainly focused on the speed and scalable architecture for the backend with light weight API.\n\nWhile He focused more on User Experience and support for Mobile Interface, Tablet, Laptop and PC.\n\nThe project is a hustle and fun for us.\nWhen the deadline of projects near us, we weren't able to complete one of our main staff application. We were really not happy of this. We made some changes to the application to work without Staff App. Our modular frontend and backend system helped us to change the way of working the application a little bit without any overhead problems.\n\nAnd at last we made some modifications to our synopsis and documentation, then we submit our project to the college.\n\n---\n\nThis project we developed with industry standards and modern architecture. You can review the codes and clone it.\n- [Admin Dashboard](https://github.com/ioNihal/sims-dashboard-front)\n- [Retailers Portal](https://github.com/ioNihal/sims-retailer-front)\n- [SIMS Backend System](https://github.com/S488U/sims-backend)\n\nIf you really liked our work. Please star our project...\n\n_**Thank you guyss**_\n\n"},{"id":2,"ready":true,"heading":"DumbCLI","desc":"Universal CLI Toolbox","url":{"github":{"link":"https://github.com/s488U/dumbcli","color":"text-white","bg":"bg-black"}},"hosted":"Hosted in Github","image":"/images/github.svg","technologies":["Javascript","Yargs","CLI-Table3","Inquirer","Prompts","Chalk"],"brief":"#### A small journey to my start of DumbCLI\n\nHi Everyone,\nI was disappointed of my windows 10 eating ram like a hungry duck. So I switched to **Vanilla Arch Linux**. When I was starting linux, I had some problems especially the terminal.\n\nThe terminal is a huge headache for a windows user. In order to tweak my OS to support my system and some visual enhancement. I was reading **Arch Wiki** and saw a huge line of commands. I was worried and tensed by seeing those commands. But to be honest its kinda cool.\n\nSomehow I catch up with the linux commands and learned about linux a lot. But I was not a freaking worm to remember all commands. When I want to tweak some settings I open the terminal and look up the terminal for a few seconds to remember the commands. But its not possible for me to remember it.\n\nSo, I thought for a second,\n_'Why can't I build a CLI tool to help me to remember the commands???'_\n\nThen I prepare to make a CLI tool to help me and planned some of the architectures.\n\n- I know JavaScript, so I thought to create in NodeJS.\n- I found out yargs and inquirer JavaScript library to capture the commands from the users terminal.\n- Chalk JS library will help us to give colors for the commands. Kinda cool.\n- Planned to use SQL Lite database for the project, but in order to test my commands. I choose to store it in a json file.\n- Used CLI Table to arrange and list all the commands.\n\n_Hmmm...! I only gave some of the libraries, not explained how the working of my project._\n\nHere: Before explaining the working of project, let me explain what I need actually. I need the tool to remember my commands, so when i type short alias for the commands it need to execute in the terminal. And It need to list all the commands like list command bash.\n\nSounds simple first, but when I started to do a prototype using chatgpt. My head filled up with large scale project.\n\nHere is the working of my project. When I type `add` command it need to add the command and store it in the JSON file. And the command will generate a unique number key for the specific command. And when I type and execute `run <id>` command it will run the command in the terminal. In order to list the command, `list` command will show all the stored commands.\n\nHuhh!! Finally its looking cool. But I need the name for the CLI tool. I was thinking a unique name and I remembered, _I was developed this is because I lack remembering commands, so I am a dumb person.So I thought, why don't you just name it DUMB??_\nHmmm,, Let's call it _**`DumbCLI`**_ then.\n\nI need to add some more featuress....\n\n_hmm???? What if the stored list gets so long and how the user knows the command is in the list??_\n\n- Let's add the command finding helper for DumbCLI.\n- After that, I've added export and import helper for importing and exporting command list to other systems.\n- Added alias for commands to run without unique key.\n- Added short key for `d`  instead `dumb` command to make it ease of use.\n- implemented dynamic inputting in saved commands before command execution.\n- implemented safety features...\n\nNow the current CLI tool have these functionalities. But remember all this I've done with the help of ChatGPT. This is just a prototype.\n\nThis is how I developed **DumbCLI** .\n\n**_Next, I want to make it more powerful, so you can do even more with your commands… stay tuned!_**\n\n**_Thank you guys for reading this.._**\n\n"},{"id":3,"ready":true,"heading":"Blog.Dunite.tech","desc":"Blog Website","url":{"live":{"link":"https://blog.dunite.tech","color":"text-white","bg":"bg-black"}},"hosted":"Hosted in Dunite","image":"/images/duploader.svg","technologies":["PHP","SQL","PHPMailer","Bootstrap","VideoJS"],"brief":"Hey Everyone,,\n\nI was learning web development back then. At that time I thought to build a _blog website_. But I don't know how to make all that in.\n\nFor the god's sake I was learning `PHP` instead of `MERN Stack`. But _PHP_ helped me in college to get good marks..\n\nyes, come to the story...\n\nPreviously I learned `Bootstrap` and build a simple static website. Later I integrate PHP and MySQL into it.\n\n- Created User and Admin sessions.\n- And a feature to blog post in it from the users profile (Anyone can post any blog in it.).\n\nThis is the basic features I added in the start.  After a while I learning so much. we got a Shared Hosting server with PHP support. And I hosted the application in it.\n\nIt was really exciting to see my work in online. We have a SMTP server and I started to develop a forgot password with a expiration token. The token will only valid for 1 hour.\n\nWhen a user requests for a password change, we will fetch if the user is available, if available we will generate a key and store it with the current time and set a expiry date along with it. And send it into user's mail box.\n\nFrom there the user can change password of their Account.\n\nLater I implemented change username and email.\n\n_Wooh!! When this gets work in online I am totally excited and happy_\n\nAfter a few months, I integrated video support where only admin can post videos and delete videos. Only the logged user can access the video section. Rest are bared from there.\n\nVideos have unique keys like `youtube` and I used `VideoJS` for the video window. User can share the video and it will auto copy the link with unique video key to users clipboard. If the user open the link in video, the video will open in seperate window and barred from the rest of the videos.\n\nAlso Blogs can only  be deleted from Admins side.\n\n> Hahaha! One guy from my college tried to break the login system and brute forced and tried SQL Injection.\n\nBecause of my Strong Implementation on the security side. It really helped. But our shared hosting got DDOS and the hosting provider helped us to get back to hosting panel.\n\n_I fight a long journey on PHP and yet I still on top of it._\n\n**Thank you guys for reading this...**"},{"id":4,"ready":true,"heading":"Dunite.tech","desc":"Study Material Website","url":{"github":{"link":"https://github.com/s488u/college","bg":"bg-black","color":"text-white"},"live":{"link":"https://dunite.tech","bg":"bg-white","color":"text-black"}},"hosted":"Hosted in Dunite","image":"/images/duploader.svg","technologies":["PHP","Bootstrap","AnimateCSS","CodeMirror"],"brief":"#### A small blog\n\nHi Everyone,\nThis is one of my largest project I've done using `PHP` and it is the most **starred** project in my GitHub.\n\nI've developed study material for myself to hold my college works in a repository for future look ups. But when the time of exam I see students are repeatedly asking teacher for the PDF's and study materials for the exam.\n\nAt that time I thought why don't you create a website where all the types of files are stored in a single place. From there students can access it.\n\nI started working on the project in exam times and a I added PHP to the project and created  a neat UI for to access the work.\n\nFirst I only added BCA study materials, and lab programs, later I given accessed the repo for my friend and he started to push the documents to the git.\n\nI know pushing large documents on the Github is not a great idea. But for temporary I've done like that. And still it is like that.\n\nI rendered the pdf's and lab programs name in the screen, when a user clicks, the link will open up a pdf opened web page were the students can download the pdf.\n\nBut I have a problem for lab programs. we are also learning `PHP` and `MySQL` in the Lab Session. But those programs are also there. Displaying the file when user clicks the link will get execute the PHP in the server side.\n\nI got a idea to implement it. I blacklisted some directories not to render php programs and I scanned all the directories and get the text from the file were the user requested and displays it on the screen.\n\nThe code are formatted by default and I used `PrismJS` to make code color highlight.\n\nAnd I implemented a custom quote window in nice code display UI with line numbers and all. You know why I implemented??\nI implemented because if the files or lab programs or else the link is broken, it defaults the user to quote window A.K.A error window.\n\nLater I redesigned the web with `Bootstrap` and `Animate CSS`.\n\n- Implemented custom link for each page.\n- Enabled link sharing for each documents.\n- Added font zoom and full window functionality for lab programs.\n\nMy web started to get popularity in BCA students. And students started to use my web for copying lab exams. I know its violation and I can't able to suspend the web on the time of exam, because other BCA batch students are also learning from the web. Because our custom lab programs are shorter and easy to understand the college lab programs.\n\nThe exam is conducting for each batch in different time. So, I implemented a warning message and a warning section where all students need to agree with the policy and I collect the public IP of the users.\n\nI tackled one of the most complex problems in one go.\n\nLater I added support for students to upload pdf with compressed zip file to add.\n\nMy MCA friend started to gather MCA study material and helped me to host it in the web.\n\n- After a few months I integrated to run the php programs safely on our server. Used `CodeMirror` for live coloring and code box.\n\n**_It is a huge win for me.._**\n\nI implemented `Google Analytics` for the web and _shocked_ to see the users in the web when near the exam time. _Still the web is using by our juniors._\n\n_**And I planned to Port the entire web to **`MERN Stack`** with newer architecture.**_\n\nIf you want to see the future updates, _star our project in the **Github**_\n\n_**Thank you guyss for reading the blog..**_"},{"id":5,"ready":false,"heading":"Movie Searcher","desc":"Search movies in your range","url":{"github":{"link":"https://github.com/s488u/Movie_API","bg":"bg-black","color":"text-white"},"live":{"link":"https://s488u.github.io/Movie_API/","bg":"bg-white","color":"text-black"}},"hosted":"Hosted in Github","image":"/images/github.svg","technologies":["HTML","Javascript","Bootstrap"]},{"id":6,"ready":false,"heading":"Indian Military","desc":"Static web with Vanilla CSS","url":{"github":{"link":"https://github.com/s488u/airforce/","bg":"bg-black","color":"text-white"},"live":{"link":"https://s488u.github.io/airforce/","bg":"bg-white","color":"text-black"}},"hosted":"Hosted in Github","image":"/images/github.svg","technologies":["HTML","CSS"]},{"id":7,"ready":false,"heading":"Newsletter","desc":"Bulk Newsletter sender in PHP","url":{"github":{"link":"https://github.com/S488U/newsletter","bg":"bg-black","color":"text-white"}},"hosted":"Hosted in Github","image":"/images/github.svg","technologies":["PHP","PHPMailer"]},{"id":8,"ready":false,"heading":"Creaxin API","desc":"Express JS API","url":{"github":{"link":"https://github.com/S488U/MY_API","bg":"bg-black","color":"text-white"},"live":{"link":"https://creaxin.vercel.app/","bg":"bg-white","color":"text-black"}},"hosted":"Hosted in Vercel","image":"/images/vercel.svg","technologies":["Javascript","NodeJS","ExpressJS","Rest API"]}],"social":[{"name":"Github","url":"https://github.com/S488U","image":"/images/github.svg"},{"name":"LinkedIn","url":"https://www.linkedin.com/in/shahabasah/","image":"/images/linkedin.svg"},{"name":"Instagram","url":"https://www.instagram.com/shahabas.ah/","image":"/images/instagram.svg"},{"name":"E-Mail","url":"mailto:shahabassabbu12@gmail.com","image":"/images/mail.svg"}],"footer":[{"name":"Github","url":"https://github.com/S488U","image":"/images/footer/github-footer.svg"},{"name":"LinkedIn","url":"https://www.linkedin.com/in/shahabasah/","image":"/images/footer/linkedin-footer.svg"},{"name":"Instagram","url":"https://www.instagram.com/shahabas.ah/","image":"/images/footer/instagram-footer.svg"},{"name":"E-Mail","url":"mailto:shahabassabbu12@gmail.com","image":"/images/footer/mail-footer.svg"}]}